### Terraform Plan — `prod`

<details>
<summary>Pass Click to expand plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
module.compute.data.aws_ecr_repository.backend: Reading...
module.compute.data.aws_ecr_repository.frontend: Reading...
module.ecs.data.aws_caller_identity.current: Reading...
module.ecs.data.aws_caller_identity.current: Read complete after 0s [id=442426888142]
module.compute.data.aws_ecr_repository.backend: Read complete after 1s [id=quickpoll-team7-backend]
module.compute.data.aws_ecr_repository.frontend: Read complete after 1s [id=quickpoll-team7-frontend]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.database.aws_cloudwatch_metric_alarm.db_connections will be created
  + resource "aws_cloudwatch_metric_alarm" "db_connections" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "RDS connections > 100 for 10 minutes"
      + alarm_name                            = "quickpoll-team7-prod-db-high-connections"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "DBInstanceIdentifier" = "quickpoll-team7-prod-db"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "DatabaseConnections"
      + namespace                             = "AWS/RDS"
      + ok_actions                            = (known after apply)
      + period                                = 300
      + statistic                             = "Average"
      + tags                                  = {
          + "Environment" = "prod"
          + "Name"        = "quickpoll-team7-prod-db-connections-alarm"
          + "Project"     = "quickpoll-team7"
        }
      + tags_all                              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-prod-db-connections-alarm"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }
      + threshold                             = 100
      + treat_missing_data                    = "missing"
    }

  # module.database.aws_cloudwatch_metric_alarm.db_cpu will be created
  + resource "aws_cloudwatch_metric_alarm" "db_cpu" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "RDS CPU utilization > 80% for 15 minutes"
      + alarm_name                            = "quickpoll-team7-prod-db-high-cpu"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "DBInstanceIdentifier" = "quickpoll-team7-prod-db"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 3
      + id                                    = (known after apply)
      + metric_name                           = "CPUUtilization"
      + namespace                             = "AWS/RDS"
      + ok_actions                            = (known after apply)
      + period                                = 300
      + statistic                             = "Average"
      + tags                                  = {
          + "Environment" = "prod"
          + "Name"        = "quickpoll-team7-prod-db-cpu-alarm"
          + "Project"     = "quickpoll-team7"
        }
      + tags_all                              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-prod-db-cpu-alarm"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }
      + threshold                             = 80
      + treat_missing_data                    = "missing"
    }

  # module.database.aws_cloudwatch_metric_alarm.db_free_storage will be created
  + resource "aws_cloudwatch_metric_alarm" "db_free_storage" {
      + actions_enabled                       = true
      + alarm_actions                         = (known after apply)
      + alarm_description                     = "RDS free storage < 5 GB"
      + alarm_name                            = "quickpoll-team7-prod-db-low-storage"
      + arn                                   = (known after apply)
      + comparison_operator                   = "LessThanThreshold"
      + dimensions                            = {
          + "DBInstanceIdentifier" = "quickpoll-team7-prod-db"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "FreeStorageSpace"
      + namespace                             = "AWS/RDS"
      + ok_actions                            = (known after apply)
      + period                                = 300
      + statistic                             = "Average"
      + tags                                  = {
          + "Environment" = "prod"
          + "Name"        = "quickpoll-team7-prod-db-storage-alarm"
          + "Project"     = "quickpoll-team7"
        }
      + tags_all                              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-prod-db-storage-alarm"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }
      + threshold                             = 5368709120
      + treat_missing_data                    = "missing"
    }

  # module.database.aws_db_event_subscription.main will be created
  + resource "aws_db_event_subscription" "main" {
      + arn              = (known after apply)
      + customer_aws_id  = (known after apply)
      + enabled          = true
      + event_categories = [
          + "backup",
          + "failure",
          + "maintenance",
          + "notification",
          + "recovery",
        ]
      + id               = (known after apply)
      + name             = "quickpoll-team7-prod-rds-events"
      + name_prefix      = (known after apply)
      + sns_topic        = (known after apply)
      + source_ids       = [
          + "quickpoll-team7-prod-db",
        ]
      + source_type      = "db-instance"
      + tags             = {
          + "Environment" = "prod"
          + "Name"        = "quickpoll-team7-prod-rds-event-sub"
          + "Project"     = "quickpoll-team7"
        }
      + tags_all         = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-prod-rds-event-sub"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }
    }

  # module.database.aws_db_instance.main will be created
  + resource "aws_db_instance" "main" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 14
      + backup_target                         = (known after apply)
      + backup_window                         = "03:00-04:00"
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = true
      + database_insights_mode                = (known after apply)
      + db_name                               = "quickpoll"
      + db_subnet_group_name                  = "quickpoll-team7-prod-db-subnet"
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + deletion_protection                   = true
      + domain_fqdn                           = (known after apply)
      + enabled_cloudwatch_logs_exports       = [
          + "postgresql",
          + "upgrade",
        ]
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = (known after apply)
      + engine_version_actual                 = (known after apply)
      + final_snapshot_identifier             = "quickpoll-team7-prod-final-snap"
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "quickpoll-team7-prod-db"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.small"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = "sun:04:00-sun:05:00"
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + max_allocated_storage                 = 100
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = true
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + performance_insights_enabled          = true
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = 31
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = false
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_throughput                    = (known after apply)
      + storage_type                          = "gp3"
      + tags                                  = {
          + "Backup"      = "enabled"
          + "Environment" = "prod"
          + "Name"        = "quickpoll-team7-prod-db"
          + "Project"     = "quickpoll-team7"
        }
      + tags_all                              = {
          + "Backup"      = "enabled"
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-prod-db"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }
      + timezone                              = (known after apply)
      + username                              = "quickpoll"
      + vpc_security_group_ids                = (known after apply)
    }

  # module.database.aws_db_subnet_group.main will be created
  + resource "aws_db_subnet_group" "main" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "quickpoll-team7-prod-db-subnet"
      + name_prefix             = (known after apply)
      + subnet_ids              = (known after apply)
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Environment" = "prod"
          + "Name"        = "quickpoll-team7-prod-db-subnet"
          + "Project"     = "quickpoll-team7"
        }
      + tags_all                = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-prod-db-subnet"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }
      + vpc_id                  = (known after apply)
    }

  # module.database.aws_sns_topic.rds_events will be created
  + resource "aws_sns_topic" "rds_events" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "quickpoll-team7-prod-rds-events"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags                        = {
          + "Environment" = "prod"
          + "Name"        = "quickpoll-team7-prod-rds-events"
          + "Project"     = "quickpoll-team7"
        }
      + tags_all                    = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-prod-rds-events"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }
      + tracing_config              = (known after apply)
    }

  # module.ecs.aws_appautoscaling_policy.backend_cpu will be created
  + resource "aws_appautoscaling_policy" "backend_cpu" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "quickpoll-team7-prod-backend-cpu-scaling"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/quickpoll-team7-prod/quickpoll-team7-prod-backend"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 300
          + scale_out_cooldown = 60
          + target_value       = 60

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # module.ecs.aws_appautoscaling_policy.backend_memory will be created
  + resource "aws_appautoscaling_policy" "backend_memory" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "quickpoll-team7-prod-backend-mem-scaling"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/quickpoll-team7-prod/quickpoll-team7-prod-backend"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 300
          + scale_out_cooldown = 60
          + target_value       = 75

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # module.ecs.aws_appautoscaling_policy.frontend_cpu will be created
  + resource "aws_appautoscaling_policy" "frontend_cpu" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "quickpoll-team7-prod-frontend-cpu-scaling"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/quickpoll-team7-prod/quickpoll-team7-prod-frontend"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 300
          + scale_out_cooldown = 60
          + target_value       = 65

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageCPUUtilization"
            }
        }
    }

  # module.ecs.aws_appautoscaling_policy.frontend_memory will be created
  + resource "aws_appautoscaling_policy" "frontend_memory" {
      + alarm_arns         = (known after apply)
      + arn                = (known after apply)
      + id                 = (known after apply)
      + name               = "quickpoll-team7-prod-frontend-mem-scaling"
      + policy_type        = "TargetTrackingScaling"
      + resource_id        = "service/quickpoll-team7-prod/quickpoll-team7-prod-frontend"
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"

      + target_tracking_scaling_policy_configuration {
          + disable_scale_in   = false
          + scale_in_cooldown  = 300
          + scale_out_cooldown = 60
          + target_value       = 80

          + predefined_metric_specification {
              + predefined_metric_type = "ECSServiceAverageMemoryUtilization"
            }
        }
    }

  # module.ecs.aws_appautoscaling_target.backend will be created
  + resource "aws_appautoscaling_target" "backend" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 6
      + min_capacity       = 2
      + resource_id        = "service/quickpoll-team7-prod/quickpoll-team7-prod-backend"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags_all           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }
    }

  # module.ecs.aws_appautoscaling_target.frontend will be created
  + resource "aws_appautoscaling_target" "frontend" {
      + arn                = (known after apply)
      + id                 = (known after apply)
      + max_capacity       = 4
      + min_capacity       = 2
      + resource_id        = "service/quickpoll-team7-prod/quickpoll-team7-prod-frontend"
      + role_arn           = (known after apply)
      + scalable_dimension = "ecs:service:DesiredCount"
      + service_namespace  = "ecs"
      + tags_all           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }
    }

  # module.ecs.aws_cloudwatch_log_group.backend will be created
  + resource "aws_cloudwatch_log_group" "backend" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/ecs/quickpoll-team7-prod-backend"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "prod"
          + "Name"        = "quickpoll-team7-prod-backend-logs"
          + "Project"     = "quickpoll-team7"
          + "Service"     = "backend"
        }
      + tags_all          = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-prod-backend-logs"
          + "Project"     = "quickpoll-team7"
          + "Service"     = "backend"
          + "Team"        = "team7"
        }
    }

  # module.ecs.aws_cloudwatch_log_group.frontend will be created
  + resource "aws_cloudwatch_log_group" "frontend" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/ecs/quickpoll-team7-prod-frontend"
      + name_prefix       = (known after apply)
      + retention_in_days = 30
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "prod"
          + "Name"        = "quickpoll-team7-prod-frontend-logs"
          + "Project"     = "quickpoll-team7"
          + "Service"     = "frontend"
        }
      + tags_all          = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-prod-frontend-logs"
          + "Project"     = "quickpoll-team7"
          + "Service"     = "frontend"
          + "Team"        = "team7"
        }
    }

  # module.ecs.aws_ecs_cluster.main will be created
  + resource "aws_ecs_cluster" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "quickpoll-team7-prod"
      + tags     = {
          + "Environment" = "prod"
          + "Name"        = "quickpoll-team7-prod-cluster"
          + "Project"     = "quickpoll-team7"
        }
      + tags_all = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-prod-cluster"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.ecs.aws_ecs_service.backend will be created
  + resource "aws_ecs_service" "backend" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "quickpoll-team7-prod-backend"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Environment" = "prod"
          + "Name"        = "quickpoll-team7-prod-backend-service"
          + "Project"     = "quickpoll-team7"
        }
      + tags_all                           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-prod-backend-service"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_circuit_breaker {
          + enable   = true
          + rollback = true
        }

      + load_balancer {
          + container_name   = "backend"
          + container_port   = 8081
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # module.ecs.aws_ecs_service.frontend will be created
  + resource "aws_ecs_service" "frontend" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "quickpoll-team7-prod-frontend"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Environment" = "prod"
          + "Name"        = "quickpoll-team7-prod-frontend-service"
          + "Project"     = "quickpoll-team7"
        }
      + tags_all                           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-prod-frontend-service"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + deployment_circuit_breaker {
          + enable   = true
          + rollback = true
        }

      + load_balancer {
          + container_name   = "frontend"
          + container_port   = 8080
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # module.ecs.aws_ecs_task_definition.backend will be created
  + resource "aws_ecs_task_definition" "backend" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "1024"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "quickpoll-team7-prod-backend"
      + id                       = (known after apply)
      + memory                   = "2048"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Environment" = "prod"
          + "Name"        = "quickpoll-team7-prod-backend-task"
          + "Project"     = "quickpoll-team7"
        }
      + tags_all                 = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-prod-backend-task"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }

  # module.ecs.aws_ecs_task_definition.frontend will be created
  + resource "aws_ecs_task_definition" "frontend" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + essential        = true
                  + healthCheck      = {
                      + command     = [
                          + "CMD-SHELL",
                          + "wget --no-verbose --tries=1 --spider http://localhost:8080/health || exit 1",
                        ]
                      + interval    = 30
                      + retries     = 3
                      + startPeriod = 10
                      + timeout     = 5
                    }
                  + image            = "placeholder:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/ecs/quickpoll-team7-prod-frontend"
                          + awslogs-region        = "eu-north-1"
                          + awslogs-stream-prefix = "frontend"
                        }
                    }
                  + name             = "frontend"
                  + portMappings     = [
                      + {
                          + containerPort = 8080
                          + protocol      = "tcp"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "512"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "quickpoll-team7-prod-frontend"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Environment" = "prod"
          + "Name"        = "quickpoll-team7-prod-frontend-task"
          + "Project"     = "quickpoll-team7"
        }
      + tags_all                 = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-prod-frontend-task"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }

  # module.ecs.aws_ssm_parameter.db_password will be created
  + resource "aws_ssm_parameter" "db_password" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "Database password for prod"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/quickpoll-team7/prod/db-password"
      + overwrite      = true
      + tags           = {
          + "Environment" = "prod"
          + "Name"        = "quickpoll-team7-prod-db-password"
          + "Project"     = "quickpoll-team7"
        }
      + tags_all       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-prod-db-password"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.ecs.aws_ssm_parameter.jwt_secret will be created
  + resource "aws_ssm_parameter" "jwt_secret" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + description    = "JWT secret for prod"
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/quickpoll-team7/prod/jwt-secret"
      + overwrite      = true
      + tags           = {
          + "Environment" = "prod"
          + "Name"        = "quickpoll-team7-prod-jwt-secret"
          + "Project"     = "quickpoll-team7"
        }
      + tags_all       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-prod-jwt-secret"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.loadbalancer.aws_lb.main will be created
  + resource "aws_lb" "main" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = true
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "quickpoll-team7-prod-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = (known after apply)
      + tags                                                         = {
          + "Environment" = "prod"
          + "Name"        = "quickpoll-team7-prod-alb"
          + "Project"     = "quickpoll-team7"
        }
      + tags_all                                                     = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-prod-alb"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)
    }

  # module.loadbalancer.aws_lb_listener.http will be created
  + resource "aws_lb_listener" "http" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags                                                                  = {
          + "Environment" = "prod"
          + "Name"        = "quickpoll-team7-prod-http-listener"
          + "Project"     = "quickpoll-team7"
        }
      + tags_all                                                              = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-prod-http-listener"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.loadbalancer.aws_lb_listener_rule.api will be created
  + resource "aws_lb_listener_rule" "api" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 100
      + tags         = {
          + "Environment" = "prod"
          + "Name"        = "quickpoll-team7-prod-api-rule"
          + "Project"     = "quickpoll-team7"
        }
      + tags_all     = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-prod-api-rule"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "/actuator/*",
                  + "/api-docs*",
                  + "/api/*",
                  + "/swagger-ui/*",
                  + "/v3/api-docs*",
                ]
            }
        }
    }

  # module.loadbalancer.aws_lb_listener_rule.jaeger will be created
  + resource "aws_lb_listener_rule" "jaeger" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 120
      + tags         = {
          + "Environment" = "prod"
          + "Name"        = "quickpoll-team7-prod-jaeger-rule"
          + "Project"     = "quickpoll-team7"
        }
      + tags_all     = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-prod-jaeger-rule"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "/jaeger/*",
                ]
            }
        }
    }

  # module.loadbalancer.aws_lb_listener_rule.monitoring will be created
  + resource "aws_lb_listener_rule" "monitoring" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = 110
      + tags         = {
          + "Environment" = "prod"
          + "Name"        = "quickpoll-team7-prod-mon-rule"
          + "Project"     = "quickpoll-team7"
        }
      + tags_all     = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-prod-mon-rule"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "/grafana/*",
                ]
            }
        }
    }

  # module.loadbalancer.aws_lb_target_group.backend will be created
  + resource "aws_lb_target_group" "backend" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "quickpoll-team7-prod-be-tg"
      + name_prefix                        = (known after apply)
      + port                               = 8081
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Environment" = "prod"
          + "Name"        = "quickpoll-team7-prod-be-tg"
          + "Project"     = "quickpoll-team7"
        }
      + tags_all                           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-prod-be-tg"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "200"
          + path                = "/actuator/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 10
          + unhealthy_threshold = 3
        }
    }

  # module.loadbalancer.aws_lb_target_group.frontend will be created
  + resource "aws_lb_target_group" "frontend" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "quickpoll-team7-prod-fe-tg"
      + name_prefix                        = (known after apply)
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Environment" = "prod"
          + "Name"        = "quickpoll-team7-prod-fe-tg"
          + "Project"     = "quickpoll-team7"
        }
      + tags_all                           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-prod-fe-tg"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "200"
          + path                = "/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }
    }

  # module.loadbalancer.aws_lb_target_group.jaeger will be created
  + resource "aws_lb_target_group" "jaeger" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "quickpoll-team7-prod-jae-tg"
      + name_prefix                        = (known after apply)
      + port                               = 16686
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Environment" = "prod"
          + "Name"        = "quickpoll-team7-prod-jae-tg"
          + "Project"     = "quickpoll-team7"
        }
      + tags_all                           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-prod-jae-tg"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }
    }

  # module.loadbalancer.aws_lb_target_group.monitoring will be created
  + resource "aws_lb_target_group" "monitoring" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "quickpoll-team7-prod-mon-tg"
      + name_prefix                        = (known after apply)
      + port                               = 3000
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Environment" = "prod"
          + "Name"        = "quickpoll-team7-prod-mon-tg"
          + "Project"     = "quickpoll-team7"
        }
      + tags_all                           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "quickpoll-team7-prod-mon-tg"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }
      + target_type                        = "ip"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "200"
          + path                = "/api/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }
    }

  # module.monitoring.aws_ecs_service.grafana will be created
  + resource "aws_ecs_service" "grafana" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = "quickpoll-team7-prod-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "quickpoll-team7-prod-grafana"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "grafana"
          + container_port   = 3000
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }
    }

  # module.monitoring.aws_ecs_service.jaeger will be created
  + resource "aws_ecs_service" "jaeger" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = "quickpoll-team7-prod-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "quickpoll-team7-prod-jaeger"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "jaeger"
          + container_port   = 16686
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }

      + service_registries {
          + registry_arn = (known after apply)
        }
    }

  # module.monitoring.aws_ecs_service.loki will be created
  + resource "aws_ecs_service" "loki" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = "quickpoll-team7-prod-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "quickpoll-team7-prod-loki"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = (known after apply)
        }

      + service_registries {
          + registry_arn = (known after apply)
        }
    }

  # module.monitoring.aws_ecs_task_definition.grafana will be created
  + resource "aws_ecs_task_definition" "grafana" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "GF_SECURITY_ADMIN_PASSWORD"
                          + value = "admin123"
                        },
                      + {
                          + name  = "GF_SERVER_ROOT_URL"
                          + value = "/grafana/"
                        },
                      + {
                          + name  = "GF_SERVER_SERVE_FROM_SUB_PATH"
                          + value = "true"
                        },
                    ]
                  + image            = "grafana/grafana:10.3.3"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-create-group  = "true"
                          + awslogs-group         = "/ecs/quickpoll-team7-prod-grafana"
                          + awslogs-region        = "eu-north-1"
                          + awslogs-stream-prefix = "grafana"
                        }
                    }
                  + mountPoints      = [
                      + {
                          + containerPath = "/var/lib/grafana"
                          + sourceVolume  = "grafana-data"
                        },
                    ]
                  + name             = "grafana"
                  + portMappings     = [
                      + {
                          + containerPort = 3000
                          + protocol      = "tcp"
                        },
                    ]
                },
            ]
        )
      + cpu                      = "512"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "quickpoll-team7-prod-grafana"
      + id                       = (known after apply)
      + memory                   = "1024"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Project"     = "quickpoll-team7"
          + "Team"        = "team7"
        }
      + track_latest             = false

      + volume {
          + configure_at_launch = (known after apply)
          + name                = "grafana-data"

          + efs_volume_configuration {
              + file_system_id          = (known after apply)
              + root_directory          = "/"
              + transit_encryption      = "ENABLED"
              + transit_encryption_port = 0

              + authorization_config {
                  + access_point_id = (known after apply)
                  + iam             = "DISABLED"
                }
            }
        }
    }

  # module.monitoring.aws_ecs_task_definition.jaeger will be created
  + resource "aws_ecs_task_definition" "jaeger" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "COLLECTOR_OTLP_ENABLED"
                          + value = "true"
                        },
                      + {
                          + name  = "QUERY_BASE_PATH"
                          + value = "/jaeger"
                        },
                    ]
                  + image            = "jaegertracing/all-in-one:1.55"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-create-group  = "true"
                          + awslogs-group         = "/ecs/quickpoll-team7-prod-jaeger"
                          + awslogs-r
... (truncated)
```

</details>

*Triggered by @Viateur-akimana on `feature/devops-observability`*